from datetime import datetime
from methods_for_api_tests.super_data import SuperData


class Data(SuperData):
    """Данные для стенда test"""

    # Комплект.GetMobileAppData
    _КGMAD_FILES_1ВНЕШНИЙДОКУМЕНТ1 = 24101231
    _КGMAD_FILES_ИМЯФАЙЛА2 = 'NO_NDFL2_9992_9992_7677150317767701001_20161220_1BEFB00F-A90E-4064-91E5-E957C3316647.XML_log.txt'
    _КGMAD_FILES_ПОДТИПДОКУМЕНТА1 = 'реестрПринятыхДокументов'
    _КGMAD_FILES_НАЗВАНИЕ1 = 'Реестр принятых справок 2-НДФЛ'
    _КGMAD_FILES_НАЗВАНИЕ2 = 'Протокол приема формы 2-НДФЛ'
    _КGMAD_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА2 = 568372
    _КGMAD_FILES_ПОДТИПДОКУМЕНТА2 = 'протоколПриема2НДФЛ'
    _КGMAD_FILES_ИМЯФАЙЛА1 = 'NO_NDFL2_9992_9992_7677150317767701001_20161220_1BEFB00F-A90E-4064-91E5-E957C3316647.XML_reestr.txt'
    _КGMAD_FILES_1ВНЕШНИЙДОКУМЕНТ2 = 24101230
    _КGMAD_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА1 = 568373
    _КGMAD_FILES_ТИПДОКУМЕНТА1 = "ОтчетФНС"


    # Requirement.GetMinutesLeft
    _RGML_VALUE = -358107

    _DELETE_QUEUE_EVENT = True  # Чистим схему от служебок
    _ACCESS_BD = True  #  Разрешить запрос к базе данных(для боевого запрет)

    _SENDER_UL_INN = '7654321069'
    _SENDER_UL_KPP = '760401001'
    _SENDER_UL_NAME = 'ЮЛ1'
    _RECEIVER_UL_INN = '7655432117'
    _RECEIVER_UL_KPP = '760401001'
    _RECEIVER_UL_NAME = 'ЮЛ2'
    _SENDER_FIO = 'Сотрудник Гост ДвеТысячиДвенадцать'
    _RECIEVER_NAME = 'Просковья'
    _RECEIVER_SECOND_NAME = 'Бухгалтер'
    _RECIEVER_THIRD_NAME = ''


    # ОтчетныйПериод.Прочитать
    _ОПП_CTID = '(0,46)'
    _ОПП_КОД = 34
    _ОПП_НАЗВАНИЕ = '2014 г.'
    _ОПП_ОТЧЕТНЫЙПЕРИОД = 46
    _ОПП_ГОД = 2014


    _2RA_FILE_NAME = 'NO_NDFL2_9992_9992_7677150317767701001_20161220_1BEFB00F-A90E-4064-91E5-E957C3316647.XML_reestr.txt'
    _ISSCAN2 = False

    # НашаОрганизация.Прочитать
    _НОП_КОНТРАГЕНТРАСШИРЕНИЕ1CHIEF = 70539
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ11ЛИЦО = 70536
    _НОП_НАШАОРГАНИЗАЦИЯ11ЛИЦО = 70536
    _НОП_ОТВЕТСТВЕННЫЙСОТРУДНИК = 880
    _НОП_CTID1НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ = '(2,17)'
    _НОП_ИДЕНТИФИКАТОР = 609895505
    _НОП_CTID1НАШАОРГАНИЗАЦИЯ = '(1,106)'
    _НОП_ЛИЦО11ЛИЦО = 70536
    _НОП_CTID = '(77,8)'
    _НОП_CTID1ЛИЦО = '(182,84)'
    _НОП_КОНТРАГЕНТРАСШИРЕНИЕ11ЛИЦО = 70536
    _НОП_CTID1КОНТРАГЕНТРАСШИРЕНИЕ = '(22,141)'
    _НОП_ОТВЕТСТВЕННЫЙСТРУКТУРА = 8925
    _НОП_1ЛИЦО = 70536
    _НОП_НАШАОРГАНИЗАЦИЯ1РУКОВОДИТЕЛЬ = 70539
    _НОП_ЧАСТНОЕЛИЦО1 = None

    # ГосударственнаяИнспекция.Прочитать
    _ГИП_КОНТРАГЕНТРАСШИРЕНИЕ11ЛИЦО = 1316
    _ГИП_CTID1КОНТРАГЕНТРАСШИРЕНИЕ = '(0,17)'
    _ГИП_ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ1КРАТКОЕНАЗВАНИЕ = 'NI_9992'
    _ГИП_CTID1ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ = '(1,57)'
    _ГИП_CTID1ЛИЦО = '(1,114)'
    _ГИП_ЛИЦО1НАЗВАНИЕ = 'FIX_NI_9992'
    _ГИП_ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ11ЛИЦО = 1316
    _ГИП_НАЗВАНИЕ = 'FIX_NI_9992'
    _ГИП_КОНТРАГЕНТРАСШИРЕНИЕ1ТЕЛЕФОН = None
    _ГИП_ЛИЦО11ЛИЦО = 1316
    _ГИП_SHORTNAME = 'FIX_9992'
    _ГИП_COUNTRYCODE = None
    _ГИП_НАЗВАНИЕПОЛНОЕ = 'FIX_9992'
    _ГИП_1ЛИЦО = 1316
    _ГИП_ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ1ТЕЛЕФОН = None
    _ГИП_НЕОТОБРАЖАЕТСЯ = None
    _ГИП_TYPE_ORG = None
    _ГИП_CTID = '(132,56)'
    _ГИП_COUNTRYCODE = None
    _ГИП_ACCOUNT_DELEGATION = None

    # Событие.Прочитать
    _СП_КОДСОБЫТИЯ = '76c44756-232a-43e7-9ce6-a727b2ed2be5'
    _СП_ТИПСДОКУМЕНТА = '7f1276d0-cb22-5e80-9b8a-d3dadbafe785'
    _СП_ДАТАДОК = None
    _СП_СТРУКТУРАПРЕДПРИЯТИЯ = 8925
    _СП_ДОКУМЕНТ = 77999
    _СП_ФИКСАЦИЯ = '2015-01-31 00:12:41.006144+03'
    _СП_1СОБЫТИЕ = 70536
    _СП_НАЧАЛО = '2015-01-31 00:12:40.990544+03'
    _СП_ОПИСАНИЕ = 'Извещение о получении Подтверждения даты получения'
    _СП_КОНЕЦ = '2015-01-31 00:12:55.108544+03'
    _СП_ИСПОЛНИТЕЛЬ = 880
    _СП_ИДСЛУЖЕБНОЙФАЗЫ = '8745f2c335d24354bc50687582d77b1d'
    _СП_ПРЕДЫДУЩЕЕСОБЫТИЕ = [70535]
    _СП_CTID = '341321'
    _СП_ПРЕДЫДУЩИЕСОБЫТИЯ = 'edb21f26-c19e-43b3-89b8-a7fe2aa0ebf7'
    _СП_РАЗДЕЛ = [70533]
    _СП_ИДРЕГЛАМЕНТА = "68a226de-7fd7-11e2-85f0-6fec1d2438e0"
    _СП_ИДФАЗЫ = "77f470c4-7fd7-11e2-ad15-73c6d0a1e772"
    _СП_РАСШИРЕНИЕДОКУМЕНТА = None

    # ERepNotice.GetMobileAppData
    # ERepNotice.GetMobileAppData
    _ERNGMAD_COMMONDATA_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА1 = 568373
    _ERNGMAD_COMMONDATA_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА2 = 568372
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_PATRONYMIC = 'йод'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_CLIENTID = 7018
    _ERNGMAD_REPORTSTAGES_DATETIME2 = '2016-12-20 12:27:03.966496+03'
    _ERNGMAD_COMMONDATA_FILES_ПОДТИПДОКУМЕНТА1 = 'реестрПринятыхДокументов'
    _ERNGMAD_COMMONDATA_FILES_ИМЯФАЙЛА2 = 'NO_NDFL2_9992_9992_7677150317767701001_20161220_1BEFB00F-A90E-4064-91E5-E957C3316647.XML_log.txt'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_SURNAME = 'проверка'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_PERSONID = 'bb5dafac-2cae-4fc4-a0f3-d7d396546cf2'
    _ERNGMAD_COMMONDATA_STATEINSPNAME = 'NI_9992'
    _ERNGMAD_COMMONDATA_FILES_1ВНЕШНИЙДОКУМЕНТ1 = 24101231
    _ERNGMAD_COMMONDATA_FILES_1ВНЕШНИЙДОКУМЕНТ2 = 24101230
    _ERNGMAD_COMMONDATA_FILES_ИМЯФАЙЛА1 = 'NO_NDFL2_9992_9992_7677150317767701001_20161220_1BEFB00F-A90E-4064-91E5-E957C3316647.XML_reestr.txt'
    _ERNGMAD_COMMONDATA_FILES_НАЗВАНИЕ1 = 'Реестр принятых справок 2-НДФЛ'
    _ERNGMAD_COMMONDATA_DATETIME = '2016-12-20 11:56:42.159148+03'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_NAME = 'йа'
    _ERNGMAD_REPORTSTAGES_DATETIME3 = '2016-12-20 12:29:04.092901+03'
    _ERNGMAD_COMMONDATA_FILES_ПОДТИПДОКУМЕНТА2 = 'протоколПриема2НДФЛ'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_FACEID = 880
    _ERNGMAD_COMMONDATA_FILES_НАЗВАНИЕ2 = 'Протокол приема формы 2-НДФЛ'
    _ERNGMAD_NOTICETYPE = 17
    _ERNGMAD_ГОД = 2014
    _ERNGMAD_ДОКУМЕНТРАСШИРЕНИЕ1НАЗВАНИЕ = "2-НДФЛ за 2014"
    _ERNGMAD_СРОК_СДАЧИ = "2015-04-01 23:59:59+03"
    _ERNGMAD_COMMONDATA_STATEINSCAPTION = "9992 - NI_9992"
    _ДAL_FILEID3 = 1





    # Документ.AttachList
    _ДAL_ATTACHID2 = '24072458'
    _ДAL_SIGNS2 = 1
    _ДAL_REDACTIONID1 = '550500'
    _ДAL_CREATEDATE1 = '2016-12-13 15:06:29.845438+03'
    _ДAL_REDACTIONID2 = '550501'
    _ДAL_COUNTREDACTIONS2 = 1
    _ДAL_CREATEDATE2 = '2016-12-13 15:06:30.280002+03'
    _ДAL_HASH2 = '550549'
    _ДAL_ATTACHID1 = '24072457'
    _ДAL_HASH1 = '550548'
    _ДAL_FILENAME1 = '123.tif'
    _ДAL_RELATIVEURL2 = '/service/?method=%D0%94%D0%BE%D0%BA%D1%83%D0%BC%D0%B5%D0%BD%D1%82.ReadFile&params=eyLQmNC00J4iOiI1NTA1MDEifQ%3D%3D&protocol=3&id=0&srv=1'
    _ДAL_LASTCHANGE2 = '2016-12-13 15:06:30.280002+03'
    _ДAL_LASTCHANGE1 = '2016-12-13 15:06:29.845438+03'
    _ДAL_FILENAME2 = 'IU_OTVNO_7677150317767701001_7677150317767701001_9992_20161213_253bbb3952aa47cfaa1892da6138e40b.xml'
    _ДAL_COUNTSIGNS2 = 1
    _ДAL_RELATIVEURL1 = '/service/?method=%D0%94%D0%BE%D0%BA%D1%83%D0%BC%D0%B5%D0%BD%D1%82.ReadFile&params=eyLQmNC00J4iOiI1NTA1MDAifQ%3D%3D&protocol=3&id=0&srv=1'
    _ДAL_COUNTERROR2 = None
    _ДAL_TITLE1 = 'приложение'
    _ДAL_TITLE2 = 'Рассылка'
    _ДAL_FILEID2 = None
    _ДAL_VERSIONID2 = None
    _ДAL_FILEID1 = None
    _ДAL_VERSIONID1 = None
    _ДAL_ISSCAN2PREVIOS = None


    # Документ.Прочитать
    _ДП_ДАТА = '2016-12-13'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ = 382695
    _ДП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ = 70536
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ = '2016-12-13 15:06:26.570440+03'
    _ДП_ИДЕНТИФИКАТОРКАТАЛОГА = None
    _ДП_ЛИЦОСОЗДАЛ = 1316
    _ДП_ТИПДОКУМЕНТА = 1490
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ = '94e5e939-96b6-448e-9cb6-f681b8e35398'
    _ДП_ЛИЦО1 = 1316
    _ДП_1ДОКУМЕНТ = 382695
    _ДП_ИДЕНТИФИКАТОРДОКУМЕНТА = '9cf59757-57d2-4317-acb9-6c524f91180a'
    _ДП_ВРЕМЯ = '15:06:26.570417+03'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1НАЗВАНИЕ = 'Сергей Васильевич'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ = '3f407a89-3380-4f67-93ba-840653fedd45'

    # Документ.Прочитать
    _ДП_1ДОКУМЕНТ02 = 391746
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ТЕКСТОШИБКИ02 = 'Вам не доступен ни один сертификат. Перейдите в реестр электронных подписей и получите новый сертификат либо оформите доверие на использование сертификатов другого пользователя'
    _ДП_ЛИЦО102 = 1316
    _ДП_СОТРУДНИК02 = 70539
    _ДП_ЛИЦОСОЗДАЛ02 = 880
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС02 = '22a356cd-5655-45f1-86b5-57a38fe87356'
    _ДП_ТИПДОКУМЕНТА02 = 1491
    _ДП_ДАТА02 = '2016-12-20'
    _ДП_ИДЕНТИФИКАТОРКАТАЛОГА02 = 'ab2d1104-1ea7-4f41-ac05-e190070e3635'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ02 = 391746
    _ДП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ02 = 70536
    _ДП_ЛИЦО302 = 70536
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ02 = '18d22c6f-33b5-4c31-8d90-81091fd7f85a'
    _ДП_ЛИЦО202 = 1316
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1КОММЕНТАРИЙ02 = '391745'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ02 = '2016-12-20 11:57:14.113129+03'
    _ДП_ИДЕНТИФИКАТОРДОКУМЕНТА02 = '1d2611bc-4c8f-40c7-82de-c8cbd0444f6b'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ02 = 'e9c7508f-4540-4b30-8779-98346766065e'
    _ДП_ВРЕМЯ02 = '12:18:17.382560+03'
    _ДП_РАЗДЕЛ02 = 391744
    _ДП_НОМЕР03 = '46'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИЗМЕНЕН02 = True
    _НОП_КОНТРАГЕНТРАСШИРЕНИЕ1ОКТМО = '78701000'
    _НОП_ИНН = "7677150317"
    _НОП_КПП = "767701001"
    _НОП_ОГРН = "3123722037414"
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ОКВЭДКОД = None
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ШАГИМАСТЕРАНУЛОТЧЕТНОСТИ1 = True
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ШАГИМАСТЕРАНУЛОТЧЕТНОСТИ2 = None
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1НАЛОГОВАЯИНСПЕКЦИЯ = None
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ФСС = None





    # Комплект.Прочитать
    _КП_ЛИЦОСОЗДАЛ = 880
    _КП_ДАТА = '2016-12-20'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1КОММЕНТАРИЙ = 'АПИ тесты не УДАЛЯТЬ!!!'
    _КП_ДОКУМЕНТ1 = None
    _КП_ИДЕНТИФИКАТОРКАТАЛОГА = 'dd0f3751-8bab-4ee7-a6f7-bb41c5220e96'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС = '22a356cd-5655-45f1-86b5-57a38fe87356'
    _КП_1ДОКУМЕНТ = 391744
    _КП_КОМПЛЕКТ1ДАТА = '2016-12-20'
    _КП_ТИПДОКУМЕНТА = 1491
    _КП_КОМПЛЕКТ1ЗНАЧИМАЯДАТА = '2016-12-20'
    _КП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ = 70536
    _КП_КОМПЛЕКТ1ОТЧЕТНЫЙПЕРИОД = 46
    _КП_ВРЕМЯ = '11:56:42.159148+03'
    _КП_КОМПЛЕКТ1ДАТАПОСЛЕДНЕЙПЕРВИЧКИ = '2016-12-20'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ = '8c6be5dd-ac6d-47d8-a41f-c73d0ac0c278'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ = 391744
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ = '570ef8c2-9572-4889-a20f-3b53610a0e11'
    _КП_КОМПЛЕКТ11ДОКУМЕНТ = 391744
    _КП_КОМПЛЕКТ1FILLINGTASKGROUPID = '076dbfa5-6eee-4098-9901-56fe755b31bb'
    _КП_КОМПЛЕКТ1ПОДПИСАНТ = 70539
    _КП_ЛИЦОИЗМЕНИЛ = 880
    _КП_ИДЕНТИФИКАТОРДОКУМЕНТА = '8d57f375-a945-4b36-bb86-60e1e441cce4'
    _КП_КОМПЛЕКТ1НАШАОРГАНИЗАЦИЯ = 70536
    _КП_КОМПЛЕКТ1LASTTASKDATETIME = '2016-12-20 11:56:53.245882+03'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ = '2016-12-20 11:56:42.343388+03'
    _КП_КОМПЛЕКТ1ВРЕМЯ = '11:56:42.159148+03'
    _КП_КОМПЛЕКТ1AUTHOR = 880
    _КП_ИДРЕГЛАМЕНТА = "c35e0f22-9ffc-11e1-8345-005056a63fed"
    _КП_НОМЕР = ""
    _КП_КОМПЛЕКТ1ИЗМЕНЕН = False
    _КП_КОМПЛЕКТ1SOURCESFILL = "Приоритет={400:Число},ЕстьДанныеДляЗаполнения={true:Логическое},ИмяКанала={mainservice.ComplectFillDefault:Строка},Заполнялся={true:Логическое},;Приоритет={100:Число},ЕстьДанныеДляЗаполнения={false:Логическое},ИмяКанала={mainservice.fsrar.fill_11_12_form:Строка},Заполнялся={false:Логическое},;Приоритет={300:Число},ЕстьДанныеДляЗаполнения={false:Логическое},ИмяКанала={mainservice.FillComplectPrevPeriod:Строка},Заполнялся={false:Логическое},;"
    _КП_КОМПЛЕКТ1ERRORFILLMSG = ""
    _КП_КОМПЛЕКТ1ДАННЫЕЗАПОЛНЕНИЯ = None
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1НАЗВАНИЕ = "2-НДФЛ за 2014"
    _КП_КОМПЛЕКТ1ДАТАСОБЫТИЯ = "2015-04-01"


    # Комплект.Прочитать
    _КП_ЛИЦО302 = 70536
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ02 = '939314e5-512c-401b-b635-b9a5236e57f2'
    _КП_ДОКУМЕНТ102 = None
    _КП_ЛИЦО102 = 1316
    _КП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ02 = 70536
    _КП_ТИПДОКУМЕНТА02 = 1742
    _КП_ИДЕНТИФИКАТОРДОКУМЕНТА02 = '8819f112-a7b4-4cfb-b011-1e47e282473c'
    _КП_КОМПЛЕКТ1ДАТА02 = '2016-12-13'
    _КП_КОМПЛЕКТ1НАШАОРГАНИЗАЦИЯ02 = 70536
    _КП_ДАТА02 = '2016-12-13'
    _КП_КОМПЛЕКТ1ЗНАЧИМАЯДАТА02 = '2016-12-13'
    _КП_ВРЕМЯ02 = '15:06:29+03'
    _КП_КОМПЛЕКТ11ДОКУМЕНТ02 = 382696
    _КП_КОМПЛЕКТ1AUTHOR02 = 1316
    _КП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ02 = 382696
    _КП_КОМПЛЕКТ1ДАТАСОБЫТИЯ02 = '2016-12-13'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ02 = '6d694fe8-f6dd-44f7-9110-123c5bb222ec'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ02 = '2016-12-13 15:06:32.570952+03'
    _КП_ЛИЦОСОЗДАЛ02 = 1316
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС02 = '9979ac8ad8fc4948b33df1396aa209c9'
    _КП_КОМПЛЕКТ1ВРЕМЯ02 = '15:06:29+03'
    _КП_ИДЕНТИФИКАТОРКАТАЛОГА02 = None
    _КП_1ДОКУМЕНТ02 = 382696

    # Документ.Прочитать
    _ДП_ЛИЦО303 = 70536
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС03 = '9979ac8ad8fc4948b33df1396aa209c9'
    _ДП_1ДОКУМЕНТ03 = 382696
    _ДП_ЛИЦО103 = 1316
    _ДП_ВРЕМЯ03 = '15:06:29+03'
    _ДП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ03 = 70536
    _ДП_ДОКУМЕНТ103 = None
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ03 = '6d694fe8-f6dd-44f7-9110-123c5bb222ec'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ03 = '939314e5-512c-401b-b635-b9a5236e57f2'
    _ДП_ТИПДОКУМЕНТА03 = 1742
    _ДП_ИДЕНТИФИКАТОРДОКУМЕНТА03 = '8819f112-a7b4-4cfb-b011-1e47e282473c'
    _ДП_ИДЕНТИФИКАТОРКАТАЛОГА03 = None
    _ДП_ЛИЦОСОЗДАЛ03 = 1316
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ03 = '2016-12-13 15:06:32.570952+03'
    _ДП_ДАТА03 = '2016-12-13'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ03 = 382696
    _ДП_НОМЕР03 = '46'


    _GLT_TEXT = 'Держите'
    _RA_FILE_NAME = 'ПротоколФЛК.xml'
    _3RA_FILE_NAME = '1165050_9992_7605016030760401001_b07c9a24-d0be-4a79-ab07-e028f859a549_20120814_b07c9a24-d0be-4a79-ab07-e028f859a550.xml'

    _MainAuthorSender = {"Идентификатор": "", "Имя": "Просковья", "Отчество": "", "Фамилия": "Бухгалтер"}

    _SENDER_SERVER_CERT = '83D5ABB0FFFF38D40C19BC829951F3572DF1C9E4'
    _SENDER_FULL_CERT = '{"Должность":"автотестер_гост2012","ИНН":"7654321069",' \
                        '"Квалифицированный":"Да","Название":"ЮЛ1","СерийныйНомер": "2D6FB75650005C9CE9113D1A216C7F83",' \
                        '"Отпечаток":"83D5ABB0FFFF38D40C19BC829951F3572DF1C9E4",' \
                        '"ФИО":"Сотрудник Гост ДвеТысячиДвенадцать"}'

    _TODAY = datetime.now().strftime('%d.%m.%Y')  # текущая дата в формате "10.09.2014"

    # сертификат требующий активации Логин: sms_pincode Пароль: 09876qwE
    _NOT_ACTIVATE_SERVER_CERT = {"ИНН": "7654321069", "Отпечаток": "37B3E320EC30FA06844547A583CB1D2E3F2A610C",
                                 "СерийныйНомер": "763975007EAAE5B247282340C3726419", "ФИО": "Сотрудник СМС Пинкод",
                                 "Должность": "Тест", 'Название': 'ЮЛ1'}

    # ИстребованиеФНС.ПрочитатьСРПДокумент
    ИФНСПСРПД_ATДОКУМЕНТ = 382696
    ИФНСПСРПД_CTID = '(1978,26)'
    ИФНСПСРПД_CTIDUSДОКУМЕНТРАСШИРЕНИЕ = '(2212,33)'
    ИФНСПСРПД_ВРЕМЯ = '15:06:29+03'
    ИФНСПСРПД_ДАТА = '2016-12-13'
    ИФНСПСРПД_ДОКУМЕНТUS = None
    ИФНСПСРПД_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ = 70536
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTATДОКУМЕНТ = 382696
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTДАТАВРЕМЯСОЗДАНИЯ = '2016-12-13 15:06:32.570952+03'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTИДЕНТИФИКАТОРВИ = '6d694fe8-f6dd-44f7-9110-123c5bb222ec'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTИДЕНТИФИКАТОРРЕДАКЦИИ = '939314e5-512c-401b-b635-b9a5236e57f2'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTПРИМЕЧАНИЕУС = '9979ac8ad8fc4948b33df1396aa209c9'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTСОСТОЯНИЕ = [True, False, True, None, True, None, None, True, False, True, False,
                                                False, None, None, None, False, None, None, None, None, None, None, None]
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTТЕКСТОШИБКИ = None
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTФЛАГИ = [True, None, False, None, None, None, None, None, None]
    ИФНСПСРПД_ИДЕНТИФИКАТОРДОКУМЕНТА = '8819f112-a7b4-4cfb-b011-1e47e282473c'
    ИФНСПСРПД_ИДЕНТИФИКАТОРКАТАЛОГА = None
    ИФНСПСРПД_ЛИЦО1 = 1316
    ИФНСПСРПД_ЛИЦО1DOTНАЗВАНИЕ = 'FIX_NI_9992'
    ИФНСПСРПД_ЛИЦО3 = 70536
    ИФНСПСРПД_ЛИЦОСОЗДАЛ = 1316
    ИФНСПСРПД_НОМЕР = '46'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_ИДО = '382696'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_ИДЕНТИФИКАТОРПЕРЕПИСКИ = '8819f112-a7b4-4cfb-b011-1e47e282473c'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ОБРАБОТКА_АКТИВНЫЙЭТАП_ИДЕНТИФИКАТОР = 596003
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ОБРАБОТКА_АКТИВНЫЙЭТАП_НАЧАЛО = '2016-12-13 15:06:34.440824+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ПОДПИСАНИЕ_ОТВЕТСТВЕННЫЙ_КОНТРАГЕНТ = 'FIX_NI_9992'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ПОДПИСАНИЕ_ПОСЛЕДНЯЯРЕДАКЦИЯДЛЯАННУЛИРОВАНИЯ = '382696'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ПОДПИСАНИЕ_ТЕКСТОШИБКИ = None
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_FILEID = None
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_VERSIONID = None
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_ATTACHID = '24072461'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_COUNTERROR = 0
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_CREATEDATE = '2016-12-13 15:06:33.382343+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_HASH = '550553'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_LASTCHANGE = '2016-12-13 15:06:33.382343+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_REDACTIONID = '550505'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_RELATIVEURL = '/service/?method=%D0%92%D0%BD%D0%B5%D1%88%D0%BD%D0%B8%D0%B9%D0%94%D0%BE%D0%BA%D1%83%D0%BC%D0%B5%D0%BD%D1%82.ReadFile&params=eyLQmNC00J4iOiI1NTA1MDUifQ%3D%3D&protocol=3&id=0&srv=1'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_FILEID2 = None
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_VERSIONID2 = None
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_ATTACHID2 = '24072462'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_COUNTERROR2 = 0
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_CREATEDATE2 = '2016-12-13 15:06:33.706759+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_FILENAME2 = '1165050_9992_7605016030760401001_b07c9a24-d0be-4a79-ab07-e028f859a549_20120814_b07c9a24-d0be-4a79-ab07-e028f859a550.xml'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_HASH2 = '550554'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_LASTCHANGE2 = '2016-12-13 15:06:33.706759+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_REDACTIONID2 = '550506'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_RELATIVEURL2 = '/service/?method=%D0%92%D0%BD%D0%B5%D1%88%D0%BD%D0%B8%D0%B9%D0%94%D0%BE%D0%BA%D1%83%D0%BC%D0%B5%D0%BD%D1%82.ReadFile&params=eyLQmNC00J4iOiI1NTA1MDYifQ%3D%3D&protocol=3&id=0&srv=1'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_SUBTYPEDOC2 = '1165050'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_TITLE2 = 'Требование о предоставлении пояснений №46'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_VERSIONFORM2 = '5.01'
    ИФНСПСРПД_ТИПДОКУМЕНТА = 1742

    # ЧастноеЛицо.MainPositionOnDateMass
    ЧЛMPODM_ЧАСТНОЕЛИЦО = 880
    ЧЛMPODM_ДОЛЖНОСТЬСОТРУДНИКА = 21485
    ЧЛMPODM_СОТРУДНИК = 24217
    ЧЛMPODM_ФАМИЛИЯ = 'проверка'
    ЧЛMPODM_ИМЯ = 'йа'
    ЧЛMPODM_ОТЧЕСТВО = 'йод'
    ЧЛMPODM_ФИО = 'проверка йа'
    ЧЛMPODM_КОНТРАГЕНТ = 208162
    ЧЛMPODM_СОТРУДНИКDOTПРИНЯТ = '2018-11-26'
    ЧЛMPODM_ТАБЕЛЬНЫЙНОМЕР = '1'
    ЧЛMPODM_РАБОЧАЯГРУППАDOTНАЗВАНИЕ = 'АГРОВОД, ОАО'
    ЧЛMPODM_СТРУКТУРАПРЕДПРИЯТИЯDOTНАЗВАНИЕ = 'АГРОВОД, ОАО'
    ЧЛMPODM_РАБОЧАЯГРУППА = 208163
    ЧЛMPODM_СТРУКТУРАПРЕДПРИЯТИЯ = 208163
    ЧЛMPODM_ДОЛЖНОСТЬDOTATДОЛЖНОСТЬ = 'руководитель'
    ЧЛMPODM_ДОЛЖНОСТЬDOTНАЗВАНИЕ = 'руководитель'
    ЧЛMPODM_ДОЛЖНОСТЬДОЛЖНОСТЬ = 1
    ЧЛMPODM_РАБОЧАЯГРУППАКОНТРАГЕНТ = 306

    # ЧастноеЛицо.ОсновнаяИнформация
    ЧЛОИ_ФАМИЛИЯ = 'проверка'
    ЧЛОИ_ИМЯ = 'йа'
    ЧЛОИ_ОТЧЕСТВО = 'йод'
    ЧЛОИ_ДАТАПРИЕМА = '2018-11-26'
    ЧЛОИ_ДОЛЖНОСТЬ = 'руководитель'
    ЧЛОИ_POSITIONID = 1
    ЧЛОИ_ATЛИЦО = 880
    ЧЛОИ_PHOTOID = '50c0d213-3266-475f-ae80-012a308e98f2?hmac=92f8e0377e01d57d2181c04828abacf72b3c75e2'
    ЧЛОИ_ФОТО = '50c0d213-3266-475f-ae80-012a308e98f2?hmac=92f8e0377e01d57d2181c04828abacf72b3c75e2'
    ЧЛОИ_DEPRECATEDCOMMENT = None
    ЧЛОИ_ПОЛЬЗОВАТЕЛЬ = 9194
    ЧЛОИ_DEPARTMENTID = 8925
    ЧЛОИ_ИДУПРАВЛЕНЧЕСКОГОПОДРАЗДЕЛЕНИЯ = 8925
    ЧЛОИ_DEPARTMENTCODE = '666'
    ЧЛОИ_WORKGROUPID = 8925
    ЧЛОИ_FULLNAME = 'проверка йа'
    ЧЛОИ_USERLINK = 145
    ЧЛОИ_ID = '880'
    ЧЛОИ_CLIENTID = 7018
    ЧЛОИ_EMAIL = 'slizcg@licuyw.ru'
    ЧЛОИ_РАБОЧИЙТЕЛЕФОН = '4843'
    # СервисПрофилей.ИдентификаторыЛиц
    СПИЛ_КЛИЕНТ = 7018
    СПИЛ_ЛИЦО = 880
    СПИЛ_ИДЕНТИФИКАТОР = 'bb5dafac-2cae-4fc4-a0f3-d7d396546cf2'

    @classmethod
    def __get_var__(cls):
        """Служебный метод для получения словаря с переменными"""

        data_dict = {}
        for key in cls.__dict__.keys():
            if not key.startswith('__'):
                data_dict[key] = cls.__dict__[key]
        return data_dict

