from datetime import datetime
from methods_for_api_tests.super_data import SuperData

class Data(SuperData):
    """Данные для стенда test"""

    # Комплект.Прочитать
    _КП_КОМПЛЕКТ1ДАТАПОСЛЕДНЕЙПЕРВИЧКИ = '2017-12-28'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ = '06b13b02-ccd5-4a67-aef0-25c352781883'
    _КП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ = 3583
    _КП_КОМПЛЕКТ1SOURCESFILL = None
    _КП_КОМПЛЕКТ1ВРЕМЯ = '14:12:56.772783+03'
    _КП_ВРЕМЯ = '14:12:56.772783+03'
    _КП_КОМПЛЕКТ1ДАННЫЕЗАПОЛНЕНИЯ = '\\"IsError"=>"false", "IsFilling"=>"false", "FormatList"=>"{}", "MethodName"=>"Комплект.FillReportsDefault", "FillingAdmin"=>"584168", "PrevMethodName"=>""'
    _КП_НОМЕР = None
    _КП_ИДРЕГЛАМЕНТА = None
    _КП_ТИПДОКУМЕНТА = 20
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС = '0b768cf7-8d7f-4e01-849e-5af1ecf9d256'
    _КП_ИДЕНТИФИКАТОРДОКУМЕНТА = '1b853794-9f4c-49fd-bc9f-6e60947dc98c'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1КОММЕНТАРИЙ = 'НЕ УДАЛЯТЬ'
    _КП_КОМПЛЕКТ1FILLINGTASKGROUPID = None
    _КП_КОМПЛЕКТ1ПОДПИСАНТ = 3587
    _КП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ = 156432
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ = 'a0e18b49-bad7-4df5-8c8d-b3905a276035'
    _КП_КОМПЛЕКТ1ЗНАЧИМАЯДАТА = '2017-12-28'
    _КП_ЛИЦОСОЗДАЛ = 2
    _КП_CTID = '(21,60)'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ = '2017-12-28 14:12:56.942990+03'
    _КП_КОМПЛЕКТ1ERRORFILLMSG = None
    _КП_КОМПЛЕКТ1ДАТА = '2017-12-28'
    _КП_CTID1КОМПЛЕКТ = '(1,51)'
    _КП_КОМПЛЕКТ1LASTTASKDATETIME = None
    _КП_ДАТА = '2017-12-28'
    _КП_КОМПЛЕКТ1ИЗМЕНЕН = True
    _КП_1ДОКУМЕНТ = 156432
    _КП_КОМПЛЕКТ1ОТЧЕТНЫЙПЕРИОД = 9
    _КП_КОМПЛЕКТ1НАШАОРГАНИЗАЦИЯ = 3583
    _КП_CTID1ДОКУМЕНТРАСШИРЕНИЕ = '(8,42)'
    _КП_ИДЕНТИФИКАТОРКАТАЛОГА = 'cd96ed69-6ad0-47fb-aaf1-c78131ccc288'
    _КП_КОМПЛЕКТ1AUTHOR = 2
    _КП_КОМПЛЕКТ11ДОКУМЕНТ = 156432
    _КП_ЛИЦОИЗМЕНИЛ = 2
    _КП_ДОКУМЕНТ1 = None
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1НАЗВАНИЕ = "2-НДФЛ за 2014"
    _КП_КОМПЛЕКТ1ДАТАСОБЫТИЯ = "2015-04-01"


    # Комплект.GetMobileAppData
    # Комплект.GetMobileAppData
    _КGMAD_FILES_1ВНЕШНИЙДОКУМЕНТ2 = 436972
    _КGMAD_FILES_ТИПДОКУМЕНТА1 = None
    _КGMAD_FILES_1ВНЕШНИЙДОКУМЕНТ1 = 436973
    _КGMAD_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА1 = 243643
    _КGMAD_FILES_НАЗВАНИЕ2 = 'Протокол приема'
    _КGMAD_FILES_ИМЯФАЙЛА2 = 'NO_NDFL2_9992_9992_7637263000763701001_20171228_9206054b-9dc3-4ba8-af7d-91d62c22ce3e.XML_log.txt'
    _КGMAD_FILES_ПОДТИПДОКУМЕНТА1 = None
    _КGMAD_FILES_НАЗВАНИЕ1 = 'Реестр принятых документов'
    _КGMAD_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА2 = 243642
    _КGMAD_FILES_ИМЯФАЙЛА1 = 'NO_NDFL2_9992_9992_7637263000763701001_20171228_9206054b-9dc3-4ba8-af7d-91d62c22ce3e.XML_reestr.txt'
    _КGMAD_FILES_ПОДТИПДОКУМЕНТА2 = None
    _КGMAD_FILES_ТИПДОКУМЕНТА2 = None

    # Requirement.GetMinutesLeft
    _RGML_VALUE = -358107

    _DELETE_QUEUE_EVENT = True  # Чистим схему от служебок
    _ACCESS_BD = True  #  Разрешить запрос к базе данных(для боевого запрет)

    _SENDER_UL_INN = '1111111660'
    _SENDER_UL_KPP = '111101001'
    _SENDER_UL_NAME = 'Автотесты ВИ Отправитель Москва'
    _RECEIVER_UL_INN = '7738845326'
    _RECEIVER_UL_KPP = '773884532'
    _RECEIVER_UL_NAME = 'Автотесты ВИ Получатель Москва'
    _SENDER_FIO = 'Сотрудник СервернаяБезЗащиты ЭЦП'
    _RECIEVER_NAME = 'ОтправительМСК'
    _RECEIVER_SECOND_NAME = 'Автотесты'
    _RECIEVER_THIRD_NAME = 'ВИ'

    # ОтчетныйПериод.Прочитать
    _ОПП_CTID = '(0,46)'
    _ОПП_КОД = 34
    _ОПП_НАЗВАНИЕ = '2014 г.'
    _ОПП_ОТЧЕТНЫЙПЕРИОД = 9
    _ОПП_ГОД = 2014


    _2RA_FILE_NAME = 'NO_NDFL2_9992_9992_7637263000763701001_20171228_9206054b-9dc3-4ba8-af7d-91d62c22ce3e.XML_log.txt'
    _ISSCAN2 = False

    # НашаОрганизация.Прочитать
    _НОП_КОНТРАГЕНТРАСШИРЕНИЕ1CHIEF = 3587
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ11ЛИЦО = 3583
    _НОП_НАШАОРГАНИЗАЦИЯ11ЛИЦО = 3583
    _НОП_ОТВЕТСТВЕННЫЙСОТРУДНИК = 2
    _НОП_CTID1НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ = '(2,17)'
    _НОП_ИДЕНТИФИКАТОР = 623358478
    _НОП_CTID1НАШАОРГАНИЗАЦИЯ = '(1,106)'
    _НОП_ЛИЦО11ЛИЦО = 3583
    _НОП_CTID = '(77,8)'
    _НОП_CTID1ЛИЦО = '(182,84)'
    _НОП_КОНТРАГЕНТРАСШИРЕНИЕ11ЛИЦО = 3583
    _НОП_CTID1КОНТРАГЕНТРАСШИРЕНИЕ = '(22,141)'
    _НОП_ОТВЕТСТВЕННЫЙСТРУКТУРА = 6
    _НОП_1ЛИЦО = 3583
    _НОП_НАШАОРГАНИЗАЦИЯ1РУКОВОДИТЕЛЬ = 3587
    _НОП_ЧАСТНОЕЛИЦО1 = None
    _НОП_КОНТРАГЕНТРАСШИРЕНИЕ1ОКТМО = None
    _НОП_ИНН = "7637263000"
    _НОП_КПП = "763701001"
    _НОП_ОГРН = "1163426618244"
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ОКВЭДКОД = ""
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ШАГИМАСТЕРАНУЛОТЧЕТНОСТИ1 = False
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ШАГИМАСТЕРАНУЛОТЧЕТНОСТИ2 = False
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1НАЛОГОВАЯИНСПЕКЦИЯ = 26
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ФСС = 36


    # ГосударственнаяИнспекция.Прочитать
    _ГИП_КОНТРАГЕНТРАСШИРЕНИЕ11ЛИЦО = 26
    _ГИП_CTID1КОНТРАГЕНТРАСШИРЕНИЕ = '(0,17)'
    _ГИП_ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ1КРАТКОЕНАЗВАНИЕ = 'NI_9992'
    _ГИП_CTID1ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ = '(1,57)'
    _ГИП_CTID1ЛИЦО = '(1,114)'
    _ГИП_ЛИЦО1НАЗВАНИЕ = 'FIX_NI_9992'
    _ГИП_ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ11ЛИЦО = 26
    _ГИП_НАЗВАНИЕ = 'FIX_NI_9992'
    _ГИП_КОНТРАГЕНТРАСШИРЕНИЕ1ТЕЛЕФОН = None
    _ГИП_ЛИЦО11ЛИЦО = 26
    _ГИП_SHORTNAME = 'FIX_9992'
    _ГИП_COUNTRYCODE = None
    _ГИП_НАЗВАНИЕПОЛНОЕ = 'FIX_9992'
    _ГИП_1ЛИЦО = 26
    _ГИП_ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ1ТЕЛЕФОН = None
    _ГИП_НЕОТОБРАЖАЕТСЯ = None
    _ГИП_TYPE_ORG = None
    _ГИП_CTID = '(132,56)'
    _ГИП_COUNTRYCODE = None
    _ГИП_ACCOUNT_DELEGATION = None

    # Событие.Прочитать
    _СП_ОПИСАНИЕ = 'Выполнение'
    _СП_КОДСОБЫТИЯ = '7eb6428b-a3df-4c12-b482-5ab519d74caa'
    _СП_ФИКСАЦИЯ = None
    _СП_1СОБЫТИЕ = 26
    _СП_ТИПСДОКУМЕНТА = 'eb139c40-a867-5148-a906-5d92fc176aa5'
    _СП_КОНЕЦ = None
    _СП_НАЧАЛО = '2015-12-03 12:26:19.605309+03'
    _СП_ИДРЕГЛАМЕНТА = '5869f4c8-a0a7-11e1-b04e-005056a63fed'
    _СП_CTID = '(369,21)'
    _СП_СТРУКТУРАПРЕДПРИЯТИЯ = 6
    _СП_ИДСЛУЖЕБНОЙФАЗЫ = None
    _СП_ИДФАЗЫ = '87881fc8-a0a7-11e1-b32e-005056a63fed'
    _СП_ПОРНОМЕР = 2
    _СП_РАСШИРЕНИЕДОКУМЕНТА = 3401955
    _СП_ИСПОЛНИТЕЛЬ = None
    _СП_ДОКУМЕНТ = 27
    _СП_ДАТАДОК = None
    _СП_ПРЕДЫДУЩЕЕСОБЫТИЕ = [None]
    _СП_ПРЕДЫДУЩИЕСОБЫТИЯ = 'edb21f26-c19e-43b3-89b8-a7fe2aa0ebf7'
    _СП_РАЗДЕЛ = [None]

    # ERepNotice.GetMobileAppData
    _ERNGMAD_COMMONDATA_FILES_ИМЯФАЙЛА2 = 'NO_NDFL2_9992_9992_7637263000763701001_20171228_9206054b-9dc3-4ba8-af7d-91d62c22ce3e.XML_log.txt'
    _ERNGMAD_COMMONDATA_FILES_1ВНЕШНИЙДОКУМЕНТ2 = 436972
    _ERNGMAD_COMMONDATA_FILES_ПОДТИПДОКУМЕНТА1 = None
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_NAME = 'Москва'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_CLIENTID = 584167
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_PERSONID = '603e6dbb-0c6d-4e96-8b5b-b41befca499f'
    _ERNGMAD_COMMONDATA_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА1 = 243643
    _ERNGMAD_COMMONDATA_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА2 = 243642
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_FACEID = 2
    _ERNGMAD_COMMONDATA_FILES_НАЗВАНИЕ2 = 'Протокол приема'
    _ERNGMAD_COMMONDATA_FILES_НАЗВАНИЕ1 = 'Реестр принятых документов'
    _ERNGMAD_COMMONDATA_DATETIME = '2017-12-28 14:12:56.772783+03'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_PATRONYMIC = 'Геннадьевич'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_SURNAME = 'ИнтТест'
    _ERNGMAD_REPORTSTAGES_DATETIME2 = '2017-12-28 14:13:11.501351+03'
    _ERNGMAD_COMMONDATA_FILES_ТИПДОКУМЕНТА2 = None
    _ERNGMAD_COMMONDATA_FILES_ИМЯФАЙЛА1 = 'NO_NDFL2_9992_9992_7637263000763701001_20171228_9206054b-9dc3-4ba8-af7d-91d62c22ce3e.XML_reestr.txt'
    _ERNGMAD_COMMONDATA_FILES_ТИПДОКУМЕНТА1 = None
    _ERNGMAD_COMMONDATA_FILES_1ВНЕШНИЙДОКУМЕНТ1 = 436973
    _ERNGMAD_COMMONDATA_FILES_ПОДТИПДОКУМЕНТА2 = None
    _ERNGMAD_REPORTSTAGES_DATETIME3 = '2017-12-28 14:21:14.059952+03'
    _ERNGMAD_NOTICETYPE = 17
    _ERNGMAD_ГОД = 2014
    _ERNGMAD_ДОКУМЕНТРАСШИРЕНИЕ1НАЗВАНИЕ = "2-НДФЛ за 2014"
    _ERNGMAD_СРОК_СДАЧИ = "2015-04-01 23:59:59+03"
    _ERNGMAD_COMMONDATA_STATEINSCAPTION = "9992 - NI_9992"





    # ERepNotice.GetMobileAppData
    _ERNGMAD_COMMONDATA_STATEINSPNAME = 'NI_9992'

    # Документ.AttachList
    _ДAL_TITLE2 = 'Письмо'
    _ДAL_HASH2 = '2017-12-28 15:24:59.536667'
    _ДAL_ATTACHID2 = '436977'
    _ДAL_HASH1 = '2017-12-28 15:25:00.568951'
    _ДAL_CREATEDATE2 = '2017-12-28 15:24:59.536667+03'
    _ДAL_COUNTERROR1 = None
    _ДAL_REDACTIONID2 = '243647'
    _ДAL_RELATIVEURL1 = '/disk/api/v1/c73ca40b-fb44-4aba-b213-9445a753f86a_b9f02e5d-abbc-46f8-9463-2124137bf827?object=simple_file_sd&uuid=e2af3a0c-3229-47e8-8dfd-ef3a60b3871a&diskhmac=fct0spk6gkmoCYyCOPHzKMry5JI%3D'
    _ДAL_CREATEDATE1 = '2017-12-28 15:25:00.568951+03'
    _ДAL_REDACTIONID1 = '243646'
    _ДAL_ATTACHID1 = '436976'
    _ДAL_TITLE1 = '123.tif'
    _ДAL_FILENAME2 = 'IU_OTVNO_7637263000763701001_7637263000763701001_9992_20171228_9bdfb5232a51461ab0484f787ad54319.xml'
    _ДAL_RELATIVEURL2 = '/disk/api/v1/7edf1a52-fe33-482a-8129-cbfd7b93211c_bb6f647e-4f5a-431b-a2f6-728b604c99c8?object=simple_file_sd&uuid=fd0916fb-a8c9-46a1-912d-88ee1bdef0dc&diskhmac=vAxr05k0hx0bsD2HMZ2TAh5Y7P0%3D'
    _ДAL_LASTCHANGE1 = '2017-12-28 15:25:00.568951+03'
    _ДAL_LASTCHANGE2 = '2017-12-28 15:24:59.536667+03'
    _ДAL_FILEID2 = '7edf1a52-fe33-482a-8129-cbfd7b93211c'
    _ДAL_VERSIONID2 = '7edf1a52-fe33-482a-8129-cbfd7b93211c_bb6f647e-4f5a-431b-a2f6-728b604c99c8'
    _ДAL_FILEID1 = 'c73ca40b-fb44-4aba-b213-9445a753f86a'
    _ДAL_VERSIONID1 = 'c73ca40b-fb44-4aba-b213-9445a753f86a_b9f02e5d-abbc-46f8-9463-2124137bf827'
    _ДAL_FILEID3 = 1
    _ДAL_ISSCAN2PREVIOS = None


    _ДAL_SIGNS2 = 1
    _ДAL_COUNTREDACTIONS2 = 1
    _ДAL_FILENAME1 = '123.tif'
    _ДAL_COUNTSIGNS2 = 1
    _ДAL_COUNTERROR2 = None

    # Документ.Прочитать
    _ДП_ЛИЦО1 = 26
    _ДП_CTID1ДОКУМЕНТРАСШИРЕНИЕ = '(4,44)'
    _ДП_ЛИЦОСОЗДАЛ = 26
    _ДП_ТИПДОКУМЕНТА = 31
    _ДП_ИДЕНТИФИКАТОРКАТАЛОГА = '17f2e92c-7476-4b13-b644-82d735688ce0'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ = '2017-12-28 15:24:20.543013+03'
    _ДП_ВРЕМЯ = '15:24:20.543010+03'
    _ДП_ИДЕНТИФИКАТОРДОКУМЕНТА = '685bc8f3-26ac-4723-91aa-b1567b190917'
    _ДП_CTID = '(17,112)'
    _ДП_1ДОКУМЕНТ = 156435
    _ДП_ДАТА = '2017-12-28'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ = 'd7b4d746-2b65-4986-9186-e73c35d97500'
    _ДП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ = 3583
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ = 156435
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ = '1bff2cd2-b989-4d1c-9ef7-59d2e2cbfea2'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1НАЗВАНИЕ = 'Сергей Васильевич'

    # Документ.Прочитать
    _ДП_CTID1ДОКУМЕНТРАСШИРЕНИЕ02 = '(8,41)'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1КОММЕНТАРИЙ02 = '156433'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИЗМЕНЕН02 = False
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ТЕКСТОШИБКИ02 = None
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС02 = '0b768cf7-8d7f-4e01-849e-5af1ecf9d256'
    _ДП_ДАТА02 = '2017-12-28'
    _ДП_ИДЕНТИФИКАТОРКАТАЛОГА02 = '387edbde-e2c5-4093-85ce-2b3c18e48e62'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ02 = '1f91e1a4-1e48-42ae-9401-e2a47ff7f686'
    _ДП_CTID02 = '(21,75)'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ02 = 156434
    _ДП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ02 = 3583
    _ДП_1ДОКУМЕНТ02 = 156434
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ02 = 'f3dea89d-46cf-4334-90d4-04c3d85104a5'
    _ДП_ЛИЦОСОЗДАЛ02 = 2
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ02 = '2017-12-28 14:13:06.916463+03'
    _ДП_ЛИЦО302 = 3583
    _ДП_ВРЕМЯ02 = '14:13:10.853357+03'
    _ДП_ТИПДОКУМЕНТА02 = 20
    _ДП_СОТРУДНИК02 = 3587
    _ДП_ИДЕНТИФИКАТОРДОКУМЕНТА02 = '0dcd4e46-bd81-4151-95b5-eb086da3d757'
    _ДП_ЛИЦО102 = 26
    _ДП_ЛИЦО202 = 26
    _ДП_РАЗДЕЛ02 = 156432
    _ДП_НОМЕР03 = '23'



    # Комплект.Прочитать
    _КП_ЛИЦО302 = 3583
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ02 = 'd443468a-7823-4a31-be4a-ad95276b0bed'
    _КП_ДОКУМЕНТ102 = None
    _КП_ЛИЦО102 = 26
    _КП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ02 = 3583
    _КП_ТИПДОКУМЕНТА02 = 47
    _КП_ИДЕНТИФИКАТОРДОКУМЕНТА02 = '8631c1bb-de0c-40a1-8d4a-ac706b021975'
    _КП_КОМПЛЕКТ1ДАТА02 = '2017-12-28'
    _КП_КОМПЛЕКТ1НАШАОРГАНИЗАЦИЯ02 = 3583
    _КП_ДАТА02 = '2017-12-28'
    _КП_КОМПЛЕКТ1ЗНАЧИМАЯДАТА02 = None
    _КП_ВРЕМЯ02 = '16:44:29+03'
    _КП_КОМПЛЕКТ11ДОКУМЕНТ02 = 156439
    _КП_КОМПЛЕКТ1AUTHOR02 = 26
    _КП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ02 = 156439
    _КП_КОМПЛЕКТ1ДАТАСОБЫТИЯ02 = None
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ02 = '8f3198c8-81ae-46f0-8649-86aa7505577b'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ02 = '2017-12-28 16:44:32.553816+03'
    _КП_ЛИЦОСОЗДАЛ02 = 26
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС02 = '09fb2d5b69d7463b9bdb41cb4c750e0d'
    _КП_КОМПЛЕКТ1ВРЕМЯ02 = '16:44:29+03'
    _КП_ИДЕНТИФИКАТОРКАТАЛОГА02 = 'f47db307-cc1d-43f6-8bde-8b951d99a0d3'
    _КП_1ДОКУМЕНТ02 = 156439


    # Документ.Прочитать
    _ДП_ЛИЦО303 = 3583
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС03 = '09fb2d5b69d7463b9bdb41cb4c750e0d'
    _ДП_1ДОКУМЕНТ03 = 156439
    _ДП_ЛИЦО103 = 26
    _ДП_ВРЕМЯ03 = '16:44:29+03'
    _ДП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ03 = 3583
    _ДП_ДОКУМЕНТ103 = None
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ03 = '8f3198c8-81ae-46f0-8649-86aa7505577b'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ03 = 'd443468a-7823-4a31-be4a-ad95276b0bed'
    _ДП_ТИПДОКУМЕНТА03 = 47
    _ДП_ИДЕНТИФИКАТОРДОКУМЕНТА03 = '8631c1bb-de0c-40a1-8d4a-ac706b021975'
    _ДП_ИДЕНТИФИКАТОРКАТАЛОГА03 = 'f47db307-cc1d-43f6-8bde-8b951d99a0d3'
    _ДП_ЛИЦОСОЗДАЛ03 = 26
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ03 = '2017-12-28 16:44:32.553816+03'
    _ДП_ДАТА03 = '2017-12-28'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ03 = 156439


    _GLT_TEXT = 'держите'
    _RA_FILE_NAME = '123.tif'
    _3RA_FILE_NAME = '1165013_9992_7838344838230401001_f8f4d64e-9191-4b35-a8f6-eb4ce8f7daaa_20130307_f8f4d64e-9191-4b35-a8f6-eb4ce8f7daaa.doc'

    _MainAuthorSender = {"Идентификатор": "", "Имя": "ОтправительМСК", "Отчество": "ВИ", "Фамилия": "Автотесты"}

    _SENDER_SERVER_CERT = '690F571BCB2F08644D180B6950242EC78FF6069B'
    _SENDER_FULL_CERT = '{"Должность":"автотестер","ИНН":"1111111660","Квалифицированный":"Да","Название":"Автотесты ВИ Отправитель Москва",' \
                        '"СерийныйНомер": "2D6FB7565000ECB0E7117461D95DC495","Отпечаток":"690F571BCB2F08644D180B6950242EC78FF6069B","ФИО":"Сотрудник СервернаяБезЗащиты ЭЦП"}'

    _TODAY = datetime.now().strftime('%d.%m.%Y')  # текущая дата в формате "10.09.2014"

    # сертификат требующий активации Логин: sms_pincode Пароль: 09876qwE
    _NOT_ACTIVATE_SERVER_CERT = {"ИНН": "1111111660", "Отпечаток": "6CACB6470B1ECB778FF7E7AF6C3BDEC042DA16E5",
                                 "СерийныйНомер": "2D6FB7565000ECB0E7119268C9A70E6D", "ФИО": "Сотрудник СМС Пинкод",
                                 "Должность": "sms_pincode_autotest", 'Название': 'Автотесты ВИ Отправитель Москва'}

    # ИстребованиеФНС.ПрочитатьСРПДокумент
    ИФНСПСРПД_ATДОКУМЕНТ = 156439
    ИФНСПСРПД_CTID = '(19,100)'
    ИФНСПСРПД_CTIDUSДОКУМЕНТРАСШИРЕНИЕ = '(6,47)'
    ИФНСПСРПД_ВРЕМЯ = '16:44:29+03'
    ИФНСПСРПД_ДАТА = '2017-12-28'
    ИФНСПСРПД_ДОКУМЕНТUS = None
    ИФНСПСРПД_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ = 3583
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTATДОКУМЕНТ = 156439
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTДАТАВРЕМЯСОЗДАНИЯ = '2017-12-28 16:44:32.553816+03'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTИДЕНТИФИКАТОРВИ = '8f3198c8-81ae-46f0-8649-86aa7505577b'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTИДЕНТИФИКАТОРРЕДАКЦИИ = 'd443468a-7823-4a31-be4a-ad95276b0bed'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTПРИМЕЧАНИЕУС = '09fb2d5b69d7463b9bdb41cb4c750e0d'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTСОСТОЯНИЕ = [True, False, True, None, True, None, None, True, False, True, False,
                                                False, None, False, None, False, None, None, None, None, None, None, None]
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTТЕКСТОШИБКИ = None
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTФЛАГИ = [True, None, None, None, None, None, None, None, None]
    ИФНСПСРПД_ИДЕНТИФИКАТОРДОКУМЕНТА = '8631c1bb-de0c-40a1-8d4a-ac706b021975'
    ИФНСПСРПД_ИДЕНТИФИКАТОРКАТАЛОГА = 'f47db307-cc1d-43f6-8bde-8b951d99a0d3'
    ИФНСПСРПД_ЛИЦО1 = 26
    ИФНСПСРПД_ЛИЦО1DOTНАЗВАНИЕ = 'FIX_NI_9992'
    ИФНСПСРПД_ЛИЦО3 = 3583
    ИФНСПСРПД_ЛИЦОСОЗДАЛ = 26
    ИФНСПСРПД_НОМЕР = '23'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_ИДО = '156439'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_ИДЕНТИФИКАТОРПЕРЕПИСКИ = '8631c1bb-de0c-40a1-8d4a-ac706b021975'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ОБРАБОТКА_АКТИВНЫЙЭТАП_ИДЕНТИФИКАТОР = 92301
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ОБРАБОТКА_АКТИВНЫЙЭТАП_НАЧАЛО = '2017-12-28 16:44:36.533894+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ПОДПИСАНИЕ_ОТВЕТСТВЕННЫЙ_КОНТРАГЕНТ = 'FIX_NI_9992'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ПОДПИСАНИЕ_ПОСЛЕДНЯЯРЕДАКЦИЯДЛЯАННУЛИРОВАНИЯ = '156439'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ПОДПИСАНИЕ_ТЕКСТОШИБКИ = None
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_FILEID = '5dc4c03a-a65f-497e-869a-c15b1e1acfbf'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_VERSIONID = '5dc4c03a-a65f-497e-869a-c15b1e1acfbf_48217ff2-ffea-4a96-a22c-b951ea2f69fb'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_ATTACHID = '436987'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_COUNTERROR = None
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_CREATEDATE = '2017-12-28 16:44:36.080328+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_HASH = '2017-12-28 16:44:36.080328'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_LASTCHANGE = '2017-12-28 16:44:36.080328+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_REDACTIONID = '243657'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_RELATIVEURL = '/disk/api/v1/5dc4c03a-a65f-497e-869a-c15b1e1acfbf_48217ff2-ffea-4a96-a22c-b951ea2f69fb?object=simple_file_sd&uuid=e5f21b82-143d-4970-9f83-e3aa3ee95449&diskhmac=e%2BqC%2BMdlLz4lm%2Fp%2FUgwRCCPkHrQ%3D'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_FILEID2 = 'add73a62-fd7e-47f1-a8ed-92472e9d424a'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_VERSIONID2 = 'add73a62-fd7e-47f1-a8ed-92472e9d424a_1cb5830b-3340-4640-b969-5074762f4d28'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_ATTACHID2 = '436988'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_COUNTERROR2 = None
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_CREATEDATE2 = '2017-12-28 16:44:35.756469+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_FILENAME2 = '1165013_9992_7838344838230401001_f8f4d64e-9191-4b35-a8f6-eb4ce8f7daaa_20130307_f8f4d64e-9191-4b35-a8f6-eb4ce8f7daaa.doc'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_HASH2 = '2017-12-28 16:44:35.756469'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_LASTCHANGE2 = '2017-12-28 16:44:35.756469+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_REDACTIONID2 = '243658'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_RELATIVEURL2 = '/disk/api/v1/add73a62-fd7e-47f1-a8ed-92472e9d424a_1cb5830b-3340-4640-b969-5074762f4d28?object=simple_file_sd&uuid=8e7f1811-91bd-4281-9419-a0d9cc5b21dd&diskhmac=g52%2FSjQruA4VWSjayfSUx4O%2BfKU%3D'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_SUBTYPEDOC2 = '1165013'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_TITLE2 = 'Требование о представлении документов (информации) №23'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_VERSIONFORM2 = None
    ИФНСПСРПД_ТИПДОКУМЕНТА = 47

    # ЧастноеЛицо.MainPositionOnDateMass
    ЧЛMPODM_ЧАСТНОЕЛИЦО = 2
    ЧЛMPODM_ДОЛЖНОСТЬСОТРУДНИКА = 942
    ЧЛMPODM_СОТРУДНИК = 942
    ЧЛMPODM_ФАМИЛИЯ = 'ИнтТест'
    ЧЛMPODM_ИМЯ = 'Москва'
    ЧЛMPODM_ОТЧЕСТВО = 'Геннадьевич'
    ЧЛMPODM_ФИО = 'ИнтТест Москва'
    ЧЛMPODM_КОНТРАГЕНТ = 306
    ЧЛMPODM_СОТРУДНИКDOTПРИНЯТ = '2011-01-01'
    ЧЛMPODM_ТАБЕЛЬНЫЙНОМЕР = '2'
    ЧЛMPODM_РАБОЧАЯГРУППАDOTНАЗВАНИЕ = 'Отчетность плюс, ООО'
    ЧЛMPODM_СТРУКТУРАПРЕДПРИЯТИЯDOTНАЗВАНИЕ = 'Отчетность плюс, ООО'
    ЧЛMPODM_РАБОЧАЯГРУППА = 307
    ЧЛMPODM_СТРУКТУРАПРЕДПРИЯТИЯ = 307
    ЧЛMPODM_ДОЛЖНОСТЬDOTATДОЛЖНОСТЬ = 'руководитель'
    ЧЛMPODM_ДОЛЖНОСТЬDOTНАЗВАНИЕ = 'руководитель'
    ЧЛMPODM_ДОЛЖНОСТЬДОЛЖНОСТЬ = 2
    ЧЛMPODM_РАБОЧАЯГРУППАКОНТРАГЕНТ = 306

    # ЧастноеЛицо.ОсновнаяИнформация
    ЧЛОИ_ФАМИЛИЯ = 'ИнтТест'
    ЧЛОИ_ИМЯ = 'Москва'
    ЧЛОИ_ОТЧЕСТВО = 'Геннадьевич'
    ЧЛОИ_ДАТАПРИЕМА = '2011-01-01'
    ЧЛОИ_ДОЛЖНОСТЬ = 'руководитель'
    ЧЛОИ_POSITIONID = 2
    ЧЛОИ_ATЛИЦО = 2
    ЧЛОИ_PHOTOID = None
    ЧЛОИ_ФОТО = None
    ЧЛОИ_DEPRECATEDCOMMENT = None
    ЧЛОИ_ПОЛЬЗОВАТЕЛЬ = 584168
    ЧЛОИ_DEPARTMENTID = 6
    ЧЛОИ_ИДУПРАВЛЕНЧЕСКОГОПОДРАЗДЕЛЕНИЯ = 6
    ЧЛОИ_DEPARTMENTCODE = None
    ЧЛОИ_WORKGROUPID = 6
    ЧЛОИ_FULLNAME = 'ИнтТест Москва'
    ЧЛОИ_USERLINK = 1
    ЧЛОИ_ID = '2'
    ЧЛОИ_CLIENTID = 584167
    ЧЛОИ_EMAIL = 'ggg@nm.ru'
    ЧЛОИ_РАБОЧИЙТЕЛЕФОН = '9359'
    # СервисПрофилей.ИдентификаторыЛиц
    СПИЛ_КЛИЕНТ = 584167
    СПИЛ_ЛИЦО = 2
    СПИЛ_ИДЕНТИФИКАТОР = '603e6dbb-0c6d-4e96-8b5b-b41befca499f'

    @classmethod
    def __get_var__(cls):
        """Служебный метод для получения словаря с переменными"""

        data_dict = {}
        for key in cls.__dict__.keys():
            if not key.startswith('__'):
                data_dict[key] = cls.__dict__[key]
        return data_dict

