from datetime import datetime
from methods_for_api_tests.super_data import SuperData


class Data(SuperData):
    """Данные для стенда test"""

    # Комплект.GetMobileAppData
    _КGMAD_FILES_1ВНЕШНИЙДОКУМЕНТ1 = 29010163
    _КGMAD_FILES_ИМЯФАЙЛА1 = 'NO_NDFL2_9992_9992_7677150317767701001_20161220_4FE71A8F-E5FB-41AB-905B-1EECE358622F.XML_reestr.txt'
    _КGMAD_FILES_ПОДТИПДОКУМЕНТА1 = None
    _КGMAD_FILES_НАЗВАНИЕ2 = 'Протокол приема'
    _КGMAD_FILES_НАЗВАНИЕ1 = 'Реестр принятых документов'
    _КGMAD_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА2 = 3061205
    _КGMAD_FILES_ПОДТИПДОКУМЕНТА2 = None
    _КGMAD_FILES_ИМЯФАЙЛА2 = 'NO_NDFL2_9992_9992_7677150317767701001_20161220_4FE71A8F-E5FB-41AB-905B-1EECE358622F.XML_log.txt'
    _КGMAD_FILES_1ВНЕШНИЙДОКУМЕНТ2 = 29010162
    _КGMAD_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА1 = 3061206
    _КGMAD_FILES_ТИПДОКУМЕНТА1 = None


    # ОтчетныйПериод.Прочитать
    _ОПП_CTID = '(0,44)'
    _ОПП_КОД = 34
    _ОПП_ГОД = 2014
    _ОПП_НАЗВАНИЕ = '2014 г.'
    _ОПП_ОТЧЕТНЫЙПЕРИОД = 37


    _RA_FILE_NAME = 'ПротоколФЛК.xml'

    _2RA_FILE_NAME = 'NO_NDFL2_9992_9992_7677150317767701001_20180522_97d85d2a-b469-4671-b5de-fd802105d92e.XML_reestr.txt'


    # НашаОрганизация.Прочитать
    _НОП_КОНТРАГЕНТРАСШИРЕНИЕ1CHIEF = 84022
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ11ЛИЦО = 84019
    _НОП_НАШАОРГАНИЗАЦИЯ11ЛИЦО = 84019
    _НОП_ОТВЕТСТВЕННЫЙСОТРУДНИК = 2429
    _НОП_CTID1НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ = '(0,72)'
    _НОП_ИДЕНТИФИКАТОР = 514901356
    _НОП_CTID1НАШАОРГАНИЗАЦИЯ = '(0,43)'
    _НОП_ЛИЦО11ЛИЦО = 84019
    _НОП_CTID = '(39,47)'
    _НОП_CTID1ЛИЦО = '(168,217)'
    _НОП_КОНТРАГЕНТРАСШИРЕНИЕ11ЛИЦО = 84019
    _НОП_CTID1КОНТРАГЕНТРАСШИРЕНИЕ = '(18,158)'
    _НОП_ОТВЕТСТВЕННЫЙСТРУКТУРА = 18879
    _НОП_1ЛИЦО = 84019
    _НОП_НАШАОРГАНИЗАЦИЯ1РУКОВОДИТЕЛЬ = 84022
    _НОП_ЧАСТНОЕЛИЦО1 = False

    # Документ.Прочитать
    _ДП_ДАТА = '2016-12-15'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ = 374098
    _ДП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ = 84019
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ = '2016-12-15 17:09:36.699004+03'
    _ДП_ИДЕНТИФИКАТОРКАТАЛОГА = '4d9e3b15-3489-4930-b35e-b2a7e8889321'
    _ДП_ЛИЦОСОЗДАЛ = 3576
    _ДП_ТИПДОКУМЕНТА = 1743
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ = '40c7e6aa-ed1e-4e8b-8cc4-e407c49d56fa'
    _ДП_ЛИЦО1 = 3576
    _ДП_1ДОКУМЕНТ = 374098
    _ДП_ИДЕНТИФИКАТОРДОКУМЕНТА = '95f7e8d0-0456-4d6a-a843-fcc7e45c970a'
    _ДП_ВРЕМЯ = '17:09:36.698997+03'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1НАЗВАНИЕ = '1211'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ = 'f4880861-463d-4496-b42f-4507d43ae29f'

    # Документ.Прочитать
    _ДП_1ДОКУМЕНТ02 = 1027091
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ТЕКСТОШИБКИ02 = None
    _ДП_ЛИЦО102 = 3576
    _ДП_СОТРУДНИК02 = 84022
    _ДП_ЛИЦОСОЗДАЛ02 = 2429
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС02 = 'a531d743-273c-4753-bb2e-3f111a6327f9'
    _ДП_ТИПДОКУМЕНТА02 = 3419
    _ДП_ДАТА02 = '2018-05-22'
    _ДП_ИДЕНТИФИКАТОРКАТАЛОГА02 = '1c0ef8d2-950a-4112-a321-35158e8b6e69'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ02 = 1027091
    _ДП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ02 = 84019
    _ДП_ЛИЦО302 = 84019
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ02 = '4a3d3627-78c8-434a-9c67-7dd8240e815b'
    _ДП_ЛИЦО202 = 3576
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1КОММЕНТАРИЙ02 = '1027090'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ02 = '2018-05-22 11:04:47.446141+03'
    _ДП_CTID1ДОКУМЕНТРАСШИРЕНИЕ02 = '(6903,48)'
    _ДП_ИДЕНТИФИКАТОРДОКУМЕНТА02 = 'ec01abc6-d685-4262-9311-f2b150fb7526'
    _ДП_CTID02 = '(484,2)'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ02 = 'bc81a16d-9dba-4f0b-a58a-0c2de230b601'
    _ДП_ВРЕМЯ02 = '11:04:53.716853+03'
    _ДП_РАЗДЕЛ02 = 1027088
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИЗМЕНЕН02 = False
    _ДП_НОМЕР03 = '46'
    _НОП_КОНТРАГЕНТРАСШИРЕНИЕ1ОКТМО = '78701000'
    _НОП_ИНН = "7677150317"
    _НОП_КПП = "767701001"
    _НОП_ОГРН = "3123722037414"
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ОКВЭДКОД = None
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ШАГИМАСТЕРАНУЛОТЧЕТНОСТИ1 = True
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ШАГИМАСТЕРАНУЛОТЧЕТНОСТИ2 = None
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1НАЛОГОВАЯИНСПЕКЦИЯ = None
    _НОП_НАШАОРГАНИЗАЦИЯРАСШИРЕНИЕ1ФСС = None




    # Комплект.Прочитать
    _КП_ЛИЦОСОЗДАЛ = 2429
    _КП_ДАТА = '2018-05-22'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1КОММЕНТАРИЙ = 'АПИ тесты не УДАЛЯТЬ!!!'
    _КП_ДОКУМЕНТ1 = '\"Комплект\"'
    _КП_ИДЕНТИФИКАТОРКАТАЛОГА = '281519e5-5517-4ed2-a9d3-c3a01a80f35f'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС = 'a531d743-273c-4753-bb2e-3f111a6327f9'
    _КП_1ДОКУМЕНТ = 1027088
    _КП_КОМПЛЕКТ1ДАТА = '2018-05-22'
    _КП_ТИПДОКУМЕНТА = 3419
    _КП_КОМПЛЕКТ1ЗНАЧИМАЯДАТА = '2018-05-22'
    _КП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ = 84019
    _КП_КОМПЛЕКТ1ОТЧЕТНЫЙПЕРИОД = 37
    _КП_ВРЕМЯ = '11:04:24.215514+03'
    _КП_КОМПЛЕКТ1ДАТАПОСЛЕДНЕЙПЕРВИЧКИ = '2018-05-22'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ = 'f2dda025-cc50-4352-a599-de56a758d483'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ = 1027088
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ = 'c2917f56-d2e6-4468-b506-99069635f4ab'
    _КП_КОМПЛЕКТ11ДОКУМЕНТ = 1027088
    _КП_КОМПЛЕКТ1FILLINGTASKGROUPID = None
    _КП_КОМПЛЕКТ1ПОДПИСАНТ = 84022
    _КП_ЛИЦОИЗМЕНИЛ = 2429
    _КП_ИДЕНТИФИКАТОРДОКУМЕНТА = '39781bfc-f471-41b2-afd5-d30a99df95cb'
    _КП_КОМПЛЕКТ1НАШАОРГАНИЗАЦИЯ = 84019
    _КП_КОМПЛЕКТ1LASTTASKDATETIME = None
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ = '2018-05-22 11:04:24.505088+03'
    _КП_КОМПЛЕКТ1ВРЕМЯ = '11:04:24.215514+03'
    _КП_КОМПЛЕКТ1AUTHOR = 2429
    _КП_ИДРЕГЛАМЕНТА = None
    _КП_НОМЕР = None
    _КП_КОМПЛЕКТ1ИЗМЕНЕН = True
    _КП_КОМПЛЕКТ1SOURCESFILL = None
    _КП_КОМПЛЕКТ1ERRORFILLMSG = None
    _КП_КОМПЛЕКТ1ДАННЫЕЗАПОЛНЕНИЯ = None
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1НАЗВАНИЕ = "2-НДФЛ за 2014"
    _КП_КОМПЛЕКТ1ДАТАСОБЫТИЯ = "2015-04-01"



    # ГосударственнаяИнспекция.Прочитать
    _ГИП_КОНТРАГЕНТРАСШИРЕНИЕ11ЛИЦО = 3576
    _ГИП_CTID1КОНТРАГЕНТРАСШИРЕНИЕ = '(77,9)'
    _ГИП_ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ1КРАТКОЕНАЗВАНИЕ = 'TEST-NI 9992'
    _ГИП_CTID1ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ = '(4,18)'
    _ГИП_CTID1ЛИЦО = '(215,41)'
    _ГИП_ЛИЦО1НАЗВАНИЕ = 'TEST-NI 9992 Ярославского региона'
    _ГИП_ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ11ЛИЦО = 3576
    _ГИП_НАЗВАНИЕ = 'TEST-NI 9992 Ярославского региона'
    _ГИП_КОНТРАГЕНТРАСШИРЕНИЕ1ТЕЛЕФОН = '111-002-67'
    _ГИП_ЛИЦО11ЛИЦО = 3576
    _ГИП_SHORTNAME = 'Test-Ni'
    _ГИП_COUNTRYCODE = '643'
    _ГИП_НАЗВАНИЕПОЛНОЕ = 'TEST-NI'
    _ГИП_1ЛИЦО = 3576
    _ГИП_ГОСУДАРСТВЕННАЯИНСПЕКЦИЯ1ТЕЛЕФОН = '11111111111-555555-7777777777777-3333333333 (_+(№\"!\"№;%:?*); 123 (asdasd); 123123123123 (-)'
    _ГИП_НЕОТОБРАЖАЕТСЯ = True
    _ГИП_TYPE_ORG = None
    _ГИП_CTID = '(201,15)'
    _ГИП_COUNTRYCODE = '643'
    _ГИП_ACCOUNT_DELEGATION = False

    # Requirement.GetMinutesLeft
    _RGML_VALUE = -355659



    _DELETE_QUEUE_EVENT = True  # Чистим схему от служебок
    _ACCESS_BD = True  # Разрешить запрос к базе данных(для боевого запрет)

    # Для документооборота
    _SENDER_UL_INN = '7654321069'
    _SENDER_UL_KPP = '760401001'
    _SENDER_UL_NAME = 'ЮЛ1'
    _RECEIVER_UL_INN = '7655432117'
    _RECEIVER_UL_KPP = '760401001'
    _RECEIVER_UL_NAME = 'ЮЛ2'
    _SENDER_FIO = 'Сотрудник СерверныйСертификат ГостДвеТысячиДвенадцать'
    _RECIEVER_NAME = 'Просковья'
    _RECEIVER_SECOND_NAME = 'Бухгалтер'
    _RECIEVER_THIRD_NAME = ''


    # Событие.Прочитать
    _СП_КОДСОБЫТИЯ = '4ef06da1-bb07-4616-aea2-1ac6ec383ddd'
    _СП_ТИПСДОКУМЕНТА = 'b42faf8b-5e74-5423-9f6a-ab274f02fe59'
    _СП_ДАТАДОК = '2014-12-19 14:38:07+03'
    _СП_СТРУКТУРАПРЕДПРИЯТИЯ = None
    _СП_ДОКУМЕНТ = 94196
    _СП_ФИКСАЦИЯ = '2014-12-19 14:38:08.727033+03'
    _СП_1СОБЫТИЕ = 84019
    _СП_НАЧАЛО = '2014-12-19 14:38:08.727033+03'
    _СП_ОПИСАНИЕ = 'Подтверждение даты получения'
    _СП_КОНЕЦ = '2014-12-19 14:38:09.507053+03'
    _СП_ИСПОЛНИТЕЛЬ = None
    _СП_ИДСЛУЖЕБНОЙФАЗЫ = '9e81a39b1924442fa5332b79effeaeb5'
    _СП_ПРЕДЫДУЩЕЕСОБЫТИЕ = [None]
    _СП_CTID = '341321'
    _СП_ПРЕДЫДУЩИЕСОБЫТИЯ = 'edb21f26-c19e-43b3-89b8-a7fe2aa0ebf7'
    _СП_РАЗДЕЛ = [83815]
    _СП_ИДРЕГЛАМЕНТА = "68a226de-7fd7-11e2-85f0-6fec1d2438e0"
    _СП_ИДФАЗЫ = "77f470c4-7fd7-11e2-ad15-73c6d0a1e772"
    _СП_РАСШИРЕНИЕДОКУМЕНТА = None



    # ERepNotice.GetMobileAppData
    _ERNGMAD_COMMONDATA_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА1 = 3061206
    _ERNGMAD_COMMONDATA_FILES_1ВЕРСИЯВНЕШНЕГОДОКУМЕНТА2 = 3061205
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_PATRONYMIC = 'фак'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_CLIENTID = 44353
    _ERNGMAD_REPORTSTAGES_DATETIME2 = '2016-12-16 13:23:15.248943+03'
    _ERNGMAD_COMMONDATA_FILES_ПОДТИПДОКУМЕНТА2 = None
    _ERNGMAD_COMMONDATA_FILES_ИМЯФАЙЛА1 = 'NO_NDFL2_9992_9992_7677150317767701001_20161220_4FE71A8F-E5FB-41AB-905B-1EECE358622F.XML_reestr.txt'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_SURNAME = 'Автотестер'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_PERSONID = '55229475-57e7-4921-861c-a025bce1f249'
    _ERNGMAD_COMMONDATA_STATEINSPNAME = 'TEST-NI 9992 (НЕ ТРОГАТЬ НАЗВАНИЕ! НА НЕГО ЗАВЯЗАНЫ ТЕСТЫ ОТЧЕТНОСТИ В ОНЛАЙНЕ!\\"'
    _ERNGMAD_COMMONDATA_FILES_1ВНЕШНИЙДОКУМЕНТ1 = 29010163
    _ERNGMAD_COMMONDATA_FILES_1ВНЕШНИЙДОКУМЕНТ2 = 29010162
    _ERNGMAD_COMMONDATA_FILES_ИМЯФАЙЛА2 = 'NO_NDFL2_9992_9992_7677150317767701001_20161220_4FE71A8F-E5FB-41AB-905B-1EECE358622F.XML_log.txt'
    _ERNGMAD_COMMONDATA_FILES_НАЗВАНИЕ2 = 'Протокол приема'
    _ERNGMAD_COMMONDATA_DATETIME = '2019-08-09 13:07:58.184613+03'
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_NAME = 'фак'
    _ERNGMAD_REPORTSTAGES_DATETIME3 = '2019-08-09 13:17:01.629610+03'
    _ERNGMAD_COMMONDATA_FILES_ПОДТИПДОКУМЕНТА1 = None
    _ERNGMAD_COMMONDATA_FACECREATORPROFILE_FACEID = 2429
    _ERNGMAD_COMMONDATA_FILES_НАЗВАНИЕ1 = 'Реестр принятых документов'
    _ERNGMAD_NOTICETYPE = 17
    _ERNGMAD_ГОД = 2014
    _ERNGMAD_ДОКУМЕНТРАСШИРЕНИЕ1НАЗВАНИЕ = "2-НДФЛ за 2014"
    _ERNGMAD_СРОК_СДАЧИ = "2015-04-01 23:59:59+03"
    _ERNGMAD_COMMONDATA_STATEINSCAPTION = '9992 - TEST-NI 9992 (НЕ ТРОГАТЬ НАЗВАНИЕ! НА НЕГО ЗАВЯЗАНЫ ТЕСТЫ ОТЧЕТНОСТИ В ОНЛАЙНЕ!\\"'

    # Документ.AttachList
    _ДAL_ATTACHID2 = '643145'
    _ДAL_SIGNS2 = 0
    _ДAL_REDACTIONID1 = '464768'
    _ДAL_CREATEDATE1 = '2016-12-15 17:09:38.229573+03'
    _ДAL_REDACTIONID2 = '464771'
    _ДAL_COUNTREDACTIONS2 = 2
    _ДAL_CREATEDATE2 = '2016-12-15 17:09:40.452406+03'
    _ДAL_HASH2 = '2016-12-15 17:09:40.452406'
    _ДAL_ATTACHID1 = '643144'
    _ДAL_HASH1 = '2016-12-15 17:09:38.229573'
    _ДAL_FILENAME1 = '60.txt'
    _ДAL_RELATIVEURL2 = '/disk/api/v1/c7713db2-ff47-45cd-906a-ec2e010c1836_0eac960b-1938-43bf-b1b9-997131dc9d0b?object=simple_file_sd&uuid=9eba27d7-e962-4a5e-b3cf-f910b5030464&diskhmac=6clist2tnYXP7zo7fK39o5b8vCM%3D'
    _ДAL_LASTCHANGE2 = '2016-12-15 17:09:40.452406+03'
    _ДAL_LASTCHANGE1 = '2016-12-15 17:09:38.229573+03'
    _ДAL_FILENAME2 = 'IU_OTVNO_7677150317767701001_7677150317767701001_9992_20161215_1ad45f515da2459ca21bf9f9ab7a92e8.xml'
    _ДAL_COUNTSIGNS2 = 0
    _ДAL_RELATIVEURL1 = '/disk/api/v1/6b8fd23a-b74e-4952-9a4b-56caee011eb0_45e151ae-c282-4e90-97ed-5c5831040fb9?object=simple_file_sd&uuid=502f55a0-3b7b-497f-a099-a711cbfe514c&diskhmac=xRwMhXHBR%2B2o95F5OVFgCovEbBQ%3D'
    _ДAL_COUNTERROR2 = 2
    _ДAL_TITLE1 = 'приложение'
    _ДAL_TITLE2 = 'Рассылка'
    _ДAL_FILEID2 = 'c7713db2-ff47-45cd-906a-ec2e010c1836'
    _ДAL_VERSIONID2 = 'c7713db2-ff47-45cd-906a-ec2e010c1836_0eac960b-1938-43bf-b1b9-997131dc9d0b'
    _ДAL_FILEID1 = '6b8fd23a-b74e-4952-9a4b-56caee011eb0'
    _ДAL_VERSIONID1 = '6b8fd23a-b74e-4952-9a4b-56caee011eb0_45e151ae-c282-4e90-97ed-5c5831040fb9'
    _ДAL_FILEID3 = 1
    _ДAL_ISSCAN2PREVIOS = 464769

    # Комплект.Прочитать
    _КП_ЛИЦО302 = 84019
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ02 = '3f158893-3f05-4e21-b1a1-ebe3ff0e606a'
    _КП_ДОКУМЕНТ102 = "\"Комплект\""
    _КП_ЛИЦО102 = 3576
    _КП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ02 = 84019
    _КП_ТИПДОКУМЕНТА02 = 3524
    _КП_ИДЕНТИФИКАТОРДОКУМЕНТА02 = '8819f112-a7b4-4cfb-b011-1e47e282453c'
    _КП_КОМПЛЕКТ1ДАТА02 = '2016-12-15'
    _КП_КОМПЛЕКТ1НАШАОРГАНИЗАЦИЯ02 = 84019
    _КП_ДАТА02 = '2016-12-15'
    _КП_КОМПЛЕКТ1ЗНАЧИМАЯДАТА02 = '2016-12-15'
    _КП_ВРЕМЯ02 = '17:09:29+03'
    _КП_КОМПЛЕКТ11ДОКУМЕНТ02 = 374097
    _КП_КОМПЛЕКТ1AUTHOR02 = 3576
    _КП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ02 = 374097
    _КП_КОМПЛЕКТ1ДАТАСОБЫТИЯ02 = '2016-12-15'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ02 = '8aa7378b-2b8d-46ac-aac6-ab1c3d120498'
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ02 = '2016-12-15 17:09:33.001168+03'
    _КП_ЛИЦОСОЗДАЛ02 = 3576
    _КП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС02 = 'b134712a654a49c6897bba7ae4519eab'
    _КП_КОМПЛЕКТ1ВРЕМЯ02 = '17:09:29+03'
    _КП_ИДЕНТИФИКАТОРКАТАЛОГА02 = '4c1b1266-4a4d-4ef1-b884-514584b82f46'
    _КП_1ДОКУМЕНТ02 = 374097

    # Документ.Прочитать
    _ДП_ЛИЦО303 = 84019
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ПРИМЕЧАНИЕУС03 = 'b134712a654a49c6897bba7ae4519eab'
    _ДП_1ДОКУМЕНТ03 = 374097
    _ДП_ЛИЦО103 = 3576
    _ДП_ВРЕМЯ03 = '17:09:29+03'
    _ДП_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ03 = 84019
    _ДП_ДОКУМЕНТ103 = "\"Комплект\""
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРВИ03 = '8aa7378b-2b8d-46ac-aac6-ab1c3d120498'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ИДЕНТИФИКАТОРРЕДАКЦИИ03 = '3f158893-3f05-4e21-b1a1-ebe3ff0e606a'
    _ДП_ТИПДОКУМЕНТА03 = 3524
    _ДП_ИДЕНТИФИКАТОРДОКУМЕНТА03 = '8819f112-a7b4-4cfb-b011-1e47e282453c'
    _ДП_ИДЕНТИФИКАТОРКАТАЛОГА03 = '4c1b1266-4a4d-4ef1-b884-514584b82f46'
    _ДП_ЛИЦОСОЗДАЛ03 = 3576
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ1ДАТАВРЕМЯСОЗДАНИЯ03 = '2016-12-15 17:09:33.001168+03'
    _ДП_ДАТА03 = '2016-12-15'
    _ДП_ДОКУМЕНТРАСШИРЕНИЕ11ДОКУМЕНТ03 = 374097
    _ДП_НОМЕР03 = '46'


    _GLT_TEXT = ''
    _ISSCAN2 = False
    _3RA_FILE_NAME = '1165050_9992_7605016030760401001_b07c9a24-d0be-4a79-ab07-e028f859a549_20120814_b07c9a24-d0be-4a79-ab07-e028f859a550.xml'

    _MainAuthorSender = {"Идентификатор": "", "Имя": "Просковья", "Отчество": "", "Фамилия": "Бухгалтер"}
    _SENDER_SERVER_CERT = 'A430EF0FF98DE71A0D4383AB87F9161A50CE5418'
    _SENDER_FULL_CERT = '{"ИНН":"7654321069","Квалифицированный":"Да","Название":"ЮЛ1","Отпечаток":"A430EF0FF98DE71A0D4383AB87F9161A50CE5418","СерийныйНомер":"2D6FB75650005C9CE911950363F429CA","ФИО":"Сотрудник СерверныйСертификат ГостДвеТысячиДвенадцать", "Должность": "серверный гост 2012"}'
    _TODAY = datetime.now().strftime('%d.%m.%Y')  # текущая дата в формате "10.09.2014"
    _NOT_ACTIVATE_SERVER_CERT = {"ИНН": "7654321069", "Отпечаток": "CC217BB846B82DC8C880AB3B74F91D75A7C72F2D",
                                 "СерийныйНомер": "64A2030173AA8CA64AA505E02AB38B11", "ФИО": "Сотрудник СМС Пинкод",
                                 "Должность": "sms_pincode_autotest", 'Название': 'ЮЛ1'}

    # ИстребованиеФНС.ПрочитатьСРПДокумент
    ИФНСПСРПД_ATДОКУМЕНТ = 374097
    ИФНСПСРПД_CTID = '(910,16)'
    ИФНСПСРПД_CTIDUSДОКУМЕНТРАСШИРЕНИЕ = '(990,4)'
    ИФНСПСРПД_ВРЕМЯ = '17:09:29+03'
    ИФНСПСРПД_ДАТА = '2016-12-15'
    ИФНСПСРПД_ДОКУМЕНТUS = '\\"Комплект\\"'
    ИФНСПСРПД_ДОКУМЕНТНАШАОРГАНИЗАЦИЯ = 84019
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTATДОКУМЕНТ = 374097
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTДАТАВРЕМЯСОЗДАНИЯ = '2016-12-15 17:09:33.001168+03'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTИДЕНТИФИКАТОРВИ = '8aa7378b-2b8d-46ac-aac6-ab1c3d120498'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTИДЕНТИФИКАТОРРЕДАКЦИИ = '3f158893-3f05-4e21-b1a1-ebe3ff0e606a'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTПРИМЕЧАНИЕУС = 'b134712a654a49c6897bba7ae4519eab'
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTСОСТОЯНИЕ = [True, False, True, None, True, None, None, True, False, True, False,
                                                False, None, None, None, False, None, None, None, None, None, None, None]
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTТЕКСТОШИБКИ = ''
    ИФНСПСРПД_ДОКУМЕНТРАСШИРЕНИЕDOTФЛАГИ = [True, None, False, None, None, None, None, None, None]
    ИФНСПСРПД_ИДЕНТИФИКАТОРДОКУМЕНТА = '8819f112-a7b4-4cfb-b011-1e47e282453c'
    ИФНСПСРПД_ИДЕНТИФИКАТОРКАТАЛОГА = '4c1b1266-4a4d-4ef1-b884-514584b82f46'
    ИФНСПСРПД_ЛИЦО1 = 3576
    ИФНСПСРПД_ЛИЦО1DOTНАЗВАНИЕ = 'TEST-NI 9992 Ярославского региона'
    ИФНСПСРПД_ЛИЦО3 = 84019
    ИФНСПСРПД_ЛИЦОСОЗДАЛ = 3576
    ИФНСПСРПД_НОМЕР = '46'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_ИДО = '374097'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_ИДЕНТИФИКАТОРПЕРЕПИСКИ = '8819f112-a7b4-4cfb-b011-1e47e282453c'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ОБРАБОТКА_АКТИВНЫЙЭТАП_ИДЕНТИФИКАТОР = 469357
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ОБРАБОТКА_АКТИВНЫЙЭТАП_НАЧАЛО = '2016-12-15 17:09:37.943867+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ПОДПИСАНИЕ_ОТВЕТСТВЕННЫЙ_КОНТРАГЕНТ = 'TEST-NI 9992 Ярославского региона'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ПОДПИСАНИЕ_ПОСЛЕДНЯЯРЕДАКЦИЯДЛЯАННУЛИРОВАНИЯ = '374097'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СОСТОЯНИЕ_ПОДПИСАНИЕ_ТЕКСТОШИБКИ = ''
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_FILEID = 'd6694122-697d-48c9-a842-eb9c82f694e9'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_VERSIONID = 'd6694122-697d-48c9-a842-eb9c82f694e9_3b57ca8c-fd14-4cb6-875f-4f02ec8bfac5'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_ATTACHID = '643139'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_COUNTERROR = 0
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_CREATEDATE = '2016-12-15 17:09:35.545479+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_HASH = '2016-12-15 17:09:35.545479'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_LASTCHANGE = '2016-12-15 17:09:35.545479+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_REDACTIONID = '464763'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_RELATIVEURL = '/disk/api/v1/d6694122-697d-48c9-a842-eb9c82f694e9_3b57ca8c-fd14-4cb6-875f-4f02ec8bfac5?object=simple_file_sd&uuid=483bd34a-48fc-474a-ac89-8bfbc3baa774&diskhmac=74vnUs0s5%2F1Et4gX9ESJWEyvM6E%3D'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_FILEID2 = 'e0db1ebd-de09-4092-a593-ba8502189ce5'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_VERSIONID2 = 'e0db1ebd-de09-4092-a593-ba8502189ce5_04f447fd-7c41-4204-ba97-1682c02daeae'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_ATTACHID2 = '643140'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_COUNTERROR2 = 0
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_CREATEDATE2 = '2016-12-15 17:09:36.733958+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_FILENAME2 = '1165050_9992_7605016030760401001_b07c9a24-d0be-4a79-ab07-e028f859a549_20120814_b07c9a24-d0be-4a79-ab07-e028f859a550.xml'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_HASH2 = '2016-12-15 17:09:36.733958'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_LASTCHANGE2 = '2016-12-15 17:09:36.733958+03'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_REDACTIONID2 = '464764'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_RELATIVEURL2 = '/disk/api/v1/e0db1ebd-de09-4092-a593-ba8502189ce5_04f447fd-7c41-4204-ba97-1682c02daeae?object=simple_file_sd&uuid=b1407304-9eab-4b5c-975d-971d82bdd7f5&diskhmac=pdZ%2FkYIjm6eSJ1CpT1Cc6KdbOLI%3D'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_SUBTYPEDOC2 = '1165050'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_TITLE2 = 'Требование о представлении пояснений №46'
    ИФНСПСРПД_РПDOTДОКУМЕНТ_СПИСОКВЛОЖЕНИЙ_VERSIONFORM2 = '5.01'
    ИФНСПСРПД_ТИПДОКУМЕНТА = 3524

    # ЧастноеЛицо.MainPositionOnDateMass
    ЧЛMPODM_ЧАСТНОЕЛИЦО = 2429
    ЧЛMPODM_ДОЛЖНОСТЬСОТРУДНИКА = 13223
    ЧЛMPODM_СОТРУДНИК = 17842
    ЧЛMPODM_ФАМИЛИЯ = 'Автотестер'
    ЧЛMPODM_ИМЯ = 'фак'
    ЧЛMPODM_ОТЧЕСТВО = 'фак'
    ЧЛMPODM_ФИО = 'Автотестер фак'
    ЧЛMPODM_КОНТРАГЕНТ = 1
    ЧЛMPODM_СОТРУДНИКDOTПРИНЯТ = '2018-06-15'
    ЧЛMPODM_ТАБЕЛЬНЫЙНОМЕР = None
    ЧЛMPODM_РАБОЧАЯГРУППАDOTНАЗВАНИЕ = 'Интеграционное Тестирование 1'
    ЧЛMPODM_СТРУКТУРАПРЕДПРИЯТИЯDOTНАЗВАНИЕ = 'Интеграционное Тестирование 1'
    ЧЛMPODM_РАБОЧАЯГРУППА = 911
    ЧЛMPODM_СТРУКТУРАПРЕДПРИЯТИЯ = 911
    ЧЛMPODM_ДОЛЖНОСТЬDOTATДОЛЖНОСТЬ = None
    ЧЛMPODM_ДОЛЖНОСТЬDOTНАЗВАНИЕ = None
    ЧЛMPODM_ДОЛЖНОСТЬДОЛЖНОСТЬ = None
    ЧЛMPODM_РАБОЧАЯГРУППАКОНТРАГЕНТ = 1

    # ЧастноеЛицо.ОсновнаяИнформация
    ЧЛОИ_ФАМИЛИЯ = 'Автотестер'
    ЧЛОИ_ИМЯ = 'фак'
    ЧЛОИ_ОТЧЕСТВО = 'фак'
    ЧЛОИ_ДАТАПРИЕМА = '2018-06-15'
    ЧЛОИ_ДОЛЖНОСТЬ = 'менеджер'
    ЧЛОИ_POSITIONID = 1
    ЧЛОИ_ATЛИЦО = 2429
    ЧЛОИ_PHOTOID = '8e74fbb8-c85e-41be-82db-2c5c7a74c6f9?hmac=36758309e15a462b7b176c3f5cbb3a7bb7119575'
    ЧЛОИ_ФОТО = '8e74fbb8-c85e-41be-82db-2c5c7a74c6f9?hmac=36758309e15a462b7b176c3f5cbb3a7bb7119575'
    ЧЛОИ_DEPRECATEDCOMMENT = ''
    ЧЛОИ_ПОЛЬЗОВАТЕЛЬ = 44693
    ЧЛОИ_DEPARTMENTID = 18879
    ЧЛОИ_ИДУПРАВЛЕНЧЕСКОГОПОДРАЗДЕЛЕНИЯ = 18879
    ЧЛОИ_DEPARTMENTCODE = '321'
    ЧЛОИ_WORKGROUPID = 18879
    ЧЛОИ_FULLNAME = 'Автотестер фак'
    ЧЛОИ_USERLINK = 455
    ЧЛОИ_ID = '2429'
    ЧЛОИ_CLIENTID = 44353
    ЧЛОИ_EMAIL = 'rnswml@rvjnhx.ru'
    ЧЛОИ_РАБОЧИЙТЕЛЕФОН = '+21 (054) 395-49-40'
    # СервисПрофилей.ИдентификаторыЛиц
    СПИЛ_КЛИЕНТ = 44353
    СПИЛ_ЛИЦО = 2429
    СПИЛ_ИДЕНТИФИКАТОР = '55229475-57e7-4921-861c-a025bce1f249'

    @classmethod
    def __get_var__(cls):
        """Служебный метод для получения словаря с переменными"""

        data_dict = {}
        for key in cls.__dict__.keys():
            if not key.startswith('__'):
                data_dict[key] = cls.__dict__[key]
        return data_dict

